#+title: Contents

Brief table of contents and todo list. Malawi has 4 rounds of data, corresponding to IHS2-IHS5.

* Files in Malawi/_/
** DONE malawi.py
Contains code common to different Malawi rounds. IHS3 through IHS5 have highly similar formats (column labels, etc.).

** DONE food_items.org

Should have columns for each year, with "Preferred Labels" and "Aggregate Labels".   Labels for different years:
#+begin_src python :results output raw table :tangle /tmp/test.py
from lsms.tools import from_dta
import dvc.api
import pyreadstat
import pandas as pd
from cfe.df_utils import df_to_orgtbl

Country = 'Malawi'

fs = dvc.api.DVCFileSystem('./')

itemlabel_location = {'2004-05':('sec_i.dta', 'i0a'),
                      '2010-11':('Full_Sample/Household/hh_mod_g1.dta','hh_g02'),
                      '2016-17':('hh_mod_g1.dta','hh_g02'),
                      '2019-20':('HH_MOD_G1.dta','hh_g02')}

reference_year = list(itemlabel_location.keys())[0]

itemlabels = {}
for k,v in itemlabel_location.items():
    try:
        with fs.open(f'/{Country}/{k}/Data/{v[0]}') as dta:
            df = from_dta(dta)
            itemlabels[k] = df[v[1]].value_counts().index.tolist()
    except ValueError:  # pd.io.stata can't read some versions of dta files...
        fs.get_file(f'/{Country}/{k}/Data/{v[0]}',f'/tmp/{v[0]}')
        df, meta = pyreadstat.read_dta(f'/tmp/{v[0]}')
        itemlabels[k] = list(meta.value_labels[v[1]].values())

# Build dictionary of dictionaries for matching
from collections import defaultdict
import difflib

D = defaultdict(dict)
#D.update({k.title():'Preferred Label' for k in itemlabels[reference_year]]})

itemlabels_reference = [s.strip().title() for s in itemlabels[reference_year]]

for wave in ['2004-05', '2010-11','2016-17', '2019-20']:
    for l in itemlabels[wave]:
        k = difflib.get_close_matches(l.title(),itemlabels_reference)
        if len(k):
            D[k[0]][wave] = l
        else:
            D[l][wave] = l

def preferred(s):
    t = s.strip().title()
    t = t.replace(' And ',' & ')
    t = t.replace(' / ','/')
    return t

# Regularize keys
D = {preferred(k):v for k,v in D.items()}

df = pd.DataFrame(D).T
df.index.name = 'Preferred Label'

print(df_to_orgtbl(df))
#+end_src

#+RESULTS:
Missing dependencies for OracleDemands.
| Preferred Label                             | 2004-05                    | 2010-11                                          | 2016-17                                          | 2019-20                                             |   |
| <20>                                        |                            |                                                  |                                                  |                                                     |   |
|                                             |                            |                                                  |                                                  |                                                     |   |
|---------------------------------------------+----------------------------+--------------------------------------------------+--------------------------------------------------+-----------------------------------------------------+---|
| Maize Ufa Mgaiwa (Normal F                  | Maize ufa mgaiwa (normal f | Maize ufa mgaiwa (normal flour)                  | Maize ufa mgaiwa (normal flour)                  | Maize ufa mgaiwa (normal flour)                     |   |
| Tomato Sauce (Bottle)                       | Tomato sauce (bottle)      | Tomato sauce (bottle)                            | Tomato sauce (bottle)                            | Tomato sauce (bottle)                               |   |
| Spices                                      | Spices                     | Spices                                           | Spices                                           | Spices                                              |   |
| Salt                                        | Salt                       | Salt                                             | Salt                                             | Salt                                                |   |
| Other Fats & Oil                            | Other fats and oil         | ---                                              | ---                                              | ---                                                 |   |
| Cooking Oil                                 | Cooking oil                | Cooking oil                                      | Cooking oil                                      | Cooking oil                                         |   |
| Sugar Cane                                  | Sugar cane                 | Sugar Cane                                       | Sugar Cane                                       | Sugar cane                                          |   |
| Sugar                                       | Sugar                      | Sugar                                            | Sugar                                            | Sugar                                               |   |
| Other Milk & Milk Produc                    | Other milk and milk produc | ---                                              | ---                                              | ---                                                 |   |
| Infant Feeding Formula                      | Infant feeding formula     | Infant feeding formula (for bottle)              | Infant feeding formula (for bottle)              | Infant feeding formula (for bottle)                 |   |
| Cheese                                      | Cheese                     | Cheese                                           | Cheese                                           | Cheese                                              |   |
| Yoghurt                                     | Yoghurt                    | Yoghurt                                          | Yoghurt                                          | Yoghurt                                             |   |
| Chambiko - Soured Milk                      | Chambiko - soured milk     | Chambiko - soured milk                           | Chambiko - soured milk                           | Chambiko - soured milk                              |   |
| Butter                                      | Butter                     | Butter                                           | Butter                                           | Butter                                              |   |
| Margarine                                   | Margarine                  | Margarine - Blue band                            | Margarine - Blue band                            | Margarine - Blue band                               |   |
| Powdered Milk                               | Powdered milk              | Powdered milk                                    | Powdered milk                                    | Powdered milk                                       |   |
| Fresh Milk                                  | Fresh milk                 | Fresh milk                                       | Fresh milk                                       | Fresh milk                                          |   |
| Other Fruits                                | Other fruits               | Other fruits (specify)                           | Other fruits (specify)                           | Other fruits (specify)                              |   |
| Apple                                       | Apple                      | Apple                                            | Apple                                            | Apple                                               |   |
| Wild Fruit (Masau, Mlambe,                  | Wild fruit (masau, mlambe, | Wild fruit (masau, malambe, etc.)                | Wild fruit (masau, malambe, etc.)                | Wild fruit (masau, malambe, etc)                    |   |
| Avocado                                     | Avocado                    | Avocado                                          | Avocado                                          | Avocado                                             |   |
| Guava                                       | Guava                      | Guava                                            | Guava                                            | Guava                                               |   |
| Papaya                                      | Papaya                     | Papaya                                           | Papaya                                           | Papaya                                              |   |
| Pineapple                                   | Pineapple                  | Pineapple                                        | Pineapple                                        | Pineapple                                           |   |
| Citrus, Naartje, Orange, E                  | Citrus, naartje, orange, e | Citrus  naartje, orange, etc.                | Citrus ï¿½ naartje, orange, etc.                 | Citrus – naartje, orange, etc                       |   |
| Banana                                      | Banana                     | Banana                                           | Banana                                           | Banana                                              |   |
| Mango                                       | Mango                      | Mango                                            | Mango                                            | Mango                                               |   |
| Yeast, Baking Powder, Bica                  | Yeast, baking powder, bica | Yeast, baking powder, bicarbonate of soda        | Yeast, baking powder, bicarbonate of soda        | Yeast, baking powder, bicarbonate of soda           |   |
| Hot Sauce (Nali, Etc.)                      | Hot sauce (nali, etc.)     | Hot sauce (Nali, etc.)                           | Hot sauce (Nali, etc.)                           | Hot sauce (Nali, etc)                               |   |
| Tinned Meat Or Fish                         | Tinned meat or fish        | Tinned meat or fish                              | Tinned meat or fish                              | Tinned meat or fish                                 |   |
| Jam, Jelly, Honey                           | Jam, jelly, honey          | Jam, jelly                                       | Jam, jelly                                       | Jam, jelly                                          |   |
| Locally Brewed Liquor                       | Locally brewed liquor      | Locally brewed liquor (kachasu)                  | Locally brewed liquor (kachasu)                  | Locally brewed liquor (kachasu )                    |   |
| Wine Or Commercial Liquor                   | Wine or commercial liquor  | Wine or commercial liquor                        | Wine or commercial liquor                        | Wine or commercial liquor                           |   |
| Traditional Beer (Masase)                   | Traditional beer (masase)  | Traditional beer (masese)                        | Traditional beer (masese)                        | Traditional beer (masese)                           |   |
| Local Sweet Beer (Thobwa)                   | Local sweet beer (thobwa)  | ---                                              | ---                                              | ---                                                 |   |
| Bottled/ Canned Beer                        | Bottled/ canned beer       | Bottled water                                    | Bottled water                                    | Bottled water                                       |   |
| Chibuku/ Napolo                             | Chibuku/ Napolo            | ---                                              | ---                                              | ---                                                 |   |
| Soft Drinks (Coca Cola, Fa                  | Soft drinks (coca cola, fa | Soft drinks (Coca-cola, Fanta, Sprite, etc.)     | Soft drinks (Coca-cola, Fanta, Sprite, etc.)     | Soft drinks (Coca-cola, Fanta, Sprite, etc)         |   |
| Freezes (Flavoured Ice)                     | Freezes (flavoured ice)    | Freezes (flavoured ice)                          | Freezes (flavoured ice)                          | Freezes (flavoured ice)                             |   |
| Fruit Juice                                 | Fruit juice                | Fruit juice                                      | Fruit juice                                      | Fruit juice                                         |   |
| Squash (Sobo Drink Concent                  | Squash (sobo drink concent | Squash (Sobo drink concentrate)                  | Squash (Sobo drink concentrate)                  | Squash (Sobo drink concentrate)                     |   |
| Coffee                                      | Coffee                     | Coffee                                           | Coffee                                           | Coffee                                              |   |
| Tea                                         | Tea                        | Tea                                              | Tea                                              | Tea                                                 |   |
| Other Cooked Foods                          | Other cooked foods         | ---                                              | ---                                              | ---                                                 |   |
| Meat Eaten At Restaurant                    | Meat eaten at restaurant   | Meal eaten at restaurant                         | Meal eaten at restaurant                         | Meal eaten at restaurant                            |   |
| Samosa (Vendor)                             | Samosa (vendor)            | Samosa (vendor)                                  | Samosa (vendor)                                  | Samosa (vendor)                                     |   |
| Mandazi, Doughnut (Vendor)                  | Mandazi, doughnut (vendor) | Mandazi, doughnut (vendor)                       | Mandazi, doughnut (vendor)                       | Mandazi, doughnut (vendor)                          |   |
| Fish (Vendor)                               | Fish (vendor)              | Fish (vendor)                                    | Fish (vendor)                                    | Fish (vendor)                                       |   |
| Meat (Vendor)                               | Meat (vendor)              | Meat (vendor)                                    | Meat (vendor)                                    | Meat (vendor)                                       |   |
| Chicken (Vendor)                            | Chicken (vendor)           | Chicken (vendor)                                 | Chicken (vendor)                                 | Chicken (vendor)                                    |   |
| Eggs - Boiled (Vendor)                      | Eggs - boiled (vendor)     | Eggs - boiled (vendor)                           | Eggs - boiled (vendor)                           | Eggs - boiled (vendor)                              |   |
| Cassava - Boiled (Vendor)                   | Cassava - boiled (vendor)  | Cassava - boiled (vendor)                        | Cassava - roasted (vendor)                       | Cassava - roasted (vendor)                          |   |
| Chips (Vendor)                              | Chips (vendor)             | Chips (vendor)                                   | Chips (vendor)                                   | Chips (vendor)                                      |   |
| Maize - Boiled Or Roasted                   | Maize - boiled or roasted  | Maize - boiled or roasted (vendor)               | Maize - boiled or roasted (vendor)               | Maize - boiled or roasted (vendor)                  |   |
| Other Spices/ Miscellaneou                  | Other spices/ miscellaneou | ---                                              | ---                                              | ---                                                 |   |
| Sweets, Candy, Chocolates                   | Sweets, candy, chocolates  | Sweets, candy, chocolates                        | Sweets, candy, chocolates                        | Sweets, candy, chocolates                           |   |
| Other Meat Fish & Animal                    | Other meat fish and animal | ---                                              | ---                                              | ---                                                 |   |
| Termites, Other Insect                      | Termites, other insect     | Termites, other insects (eg Ngumbi, caterpillar) | Termites, other insects (eg Ngumbi, caterpillar) | Termites, other insects (eg Ngumbi, caterpillar)    |   |
| Maize Ufa Refined (Fine Fl                  | Maize ufa refined (fine fl | Maize ufa refined (fine flour)                   | Maize ufa refined (fine flour)                   | Maize ufa refined (fine flour)                      |   |
| Pigeon Pea (Nandolo)                        | Pigeon pea (nandolo)       | Pigeonpea (nandolo)                              | Pigeonpea (nandolo)                              | Pigeon pea (nandolo)                                |   |
| Bean, White                                 | Bean, white                | Bean, white                                      | Bean, white                                      | Bean, white                                         |   |
| Other Roots & Tubers                        | Other roots and tubers     | ---                                              | ---                                              | ---                                                 |   |
| Cocoyam (Masimbi)                           | Cocoyam (masimbi)          | Cocoyam (masimbi)                                | Cocoyam (masimbi)                                | Cocoyam (masimbi)                                   |   |
| Plantain, Cooking Banana                    | Plantain, cooking banana   | Plantain, cooking banana                         | Plantain, cooking banana                         | Plantain, cooking banana                            |   |
| Potato Crisps                               | Potato crisps              | Potato crisps                                    | Potato crisps                                    | Potato crisps                                       |   |
| Irish Potato                                | Irish potato               | Irish potato                                     | Irish potato                                     | Irish Potato                                        |   |
| Orange Sweet Potato                         | Orange sweet potato        | Orange sweet potato                              | Orange sweet potato                              | Orange sweet potato                                 |   |
| White Sweet Potato                          | White sweet potato         | White sweet potato                               | White sweet potato                               | White sweet potato                                  |   |
| Cassava Flour                               | Cassava flour              | Cassava flour                                    | Cassava flour                                    | Cassava flour                                       |   |
| Cassava Tubers                              | Cassava tubers             | Cassava tubers                                   | Cassava tubers                                   | Cassava tubers                                      |   |
| Other Cereals                               | Other cereals              | ---                                              | ---                                              | ---                                                 |   |
| Infant Feeding Cereals                      | Infant feeding cereals     | Infant feeding cereals                           | Infant feeding cereals                           | Infant feeding cereals                              |   |
| Breakfast Cereal                            | Breakfast cereal           | Breakfast cereal                                 | Breakfast cereal                                 | Breakfast cereals                                   |   |
| Spaghetti, Macaroni, Pasta                  | Spaghetti, macaroni, pasta | Spaghetti, macaroni, pasta                       | Spaghetti, macaroni, pasta                       | Spaghetti, macaroni, pasta                          |   |
| Biscuits                                    | Biscuits                   | Biscuits                                         | Biscuits                                         | Biscuits                                            |   |
| Buns, Scones                                | Buns, scones               | Buns, scones                                     | Buns, scones                                     | Buns, scones                                        |   |
| Bread                                       | Bread                      | Bread                                            | Bread                                            | Bread                                               |   |
| Wheat Flour                                 | Wheat flour                | Wheat flour                                      | Wheat flour                                      | Wheat flour                                         |   |
| Pearl Millet                                | Pearl millet               | Pearl millet (mchewere)                          | Pearl millet (mchewere)                          | Pearl millet (mchewere)                             |   |
| Sorghum                                     | Sorghum                    | Sorghum (mapira)                                 | Sorghum (mapira)                                 | Sorghum (mapira)                                    |   |
| Finger Millet                               | Finger millet              | Finger millet (mawere)                           | Finger millet (mawere)                           | Finger millet (mawere)                              |   |
| Rice                                        | Rice                       | Rice                                             | Rice                                             | Rice                                                |   |
| Green Maize                                 | Green maize                | Green maize                                      | Green maize                                      | Green Maize                                         |   |
| Maize Grain (Not As Ufa)                    | Maize grain (not as ufa)   | Maize grain (not as ufa)                         | Maize grain (not as ufa)                         | Maize grain (not as ufa)                            |   |
| Maize Ufa Madeya (Bran Flo                  | Maize ufa madeya (bran flo | Maize ufa madeya (bran flour)                    | Maize ufa madeya (bran flour)                    | Maize ufa processed madeya (bran flour - processed) |   |
| Bean, Brown                                 | Bean, brown                | Bean, brown                                      | Bean, brown                                      | Bean, brown                                         |   |
| Groundnut                                   | Groundnut                  | Groundnut                                        | Boiled groundnuts                                | Boiled groundnuts                                   |   |
| Small Animal- Rabbit, Mice                  | Small animal- rabbit, mice | Small animal  rabbit, mice, etc.             | Small animal ï¿½ rabbit, mice, etc.              | Small animal – rabbit, mice, etc                    |   |
| Groundnut Flour                             | Groundnut flour            | Groundnut flour                                  | Groundnut (unshelled)                            | Groundnut (Shelled)                                 |   |
| Other Poultry-Guinea Fowl,                  | Other poultry-guinea fowl, | Other poultry - guinea fowl, doves, etc.         | Other poultry - guinea fowl, doves, etc.         | Other poultry - guinea fowl, doves, etc             |   |
| Chicken                                     | Chicken                    | Chicken                                          | Chicken                                          | Chicken - Whole                                     |   |
| Pork                                        | Pork                       | Pork                                             | Pork                                             | Pork                                                |   |
| Goat                                        | Goat                       | Goat                                             | Goat                                             | Goat                                                |   |
| Beef                                        | Beef                       | Beef                                             | Beef                                             | Beef                                                |   |
| Fresh Fish                                  | Fresh fish                 | Fresh fish                                       | ---                                              | ---                                                 |   |
| Dried Fish                                  | Dried fish                 | Dried fish                                       | ---                                              | ---                                                 |   |
| Other Vegetable                             | Other vegetable            | Other vegetables (Specify)                       | Other vegetables (Specify)                       | ---                                                 |   |
| Tinned Vegetables                           | Tinned vegetables          | Tinned vegetables (Specify)                      | Tinned vegetables (Specify)                      | Tinned vegetables (specify)                         |   |
| Okra/Therere                                | Okra / Therere             | Okra / Therere                                   | Okra / Therere                                   | Okra / Therere                                      |   |
| Pumpkin                                     | Pumpkin                    | Pumpkin                                          | Pumpkin                                          | Pumpkin                                             |   |
| Cucumber                                    | Cucumber                   | Cucumber                                         | Cucumber                                         | Cucumber                                            |   |
| Tomato                                      | Tomato                     | Tomato                                           | Tomato                                           | Tomato                                              |   |
| Gathered Wild Green Leaves                  | Gathered wild green leaves | Gathered wild green leaves                       | Gathered wild green leaves                       | Gathered wild green leaves                          |   |
| Other Cultivated Green Lea                  | Other cultivated green lea | Other cultivated green leafy vegetables          | Other cultivated green leafy vegetables          | Other cultivated green leafy vegetables             |   |
| Chinese Cabbage                             | Chinese cabbage            | Chinese cabbage                                  | Chinese cabbage                                  | Chinese cabbage                                     |   |
| Nkwani                                      | Nkwani                     | Nkhwani                                          | Nkhwani                                          | Nkhwani                                             |   |
| Tanaposi Rape                               | Tanaposi rape              | Tanaposi/Rape                                    | Tanaposi/Rape                                    | Tanaposi/Rape                                       |   |
| Cabbage                                     | Cabbage                    | Cabbage                                          | Cabbage                                          | Cabbage                                             |   |
| Onion                                       | Onion                      | Onion                                            | Onion                                            | Onion                                               |   |
| Other Pulses                                | Other pulses               | ---                                              | ---                                              | ---                                                 |   |
| Cowpea (Khobwe)                             | Cowpea (khobwe)            | Cowpea (khobwe)                                  | Cowpea (khobwe)                                  | Cowpea (khobwe)                                     |   |
| Ground Bean                                 | Ground bean                | Ground bean (nzama)                              | Ground bean (nzama)                              | Ground bean (nzama)                                 |   |
| Soyabean Flour                              | Soyabean flour             | Soyabean flour                                   | Soyabean flour                                   | Soyabean flour                                      |   |
| Other Beverages                             | Other beverages            | ---                                              | ---                                              | ---                                                 |   |
| Eggs                                        | Eggs                       | Eggs                                             | Eggs                                             | Eggs                                                |   |
| Other (Specify)                             | ---                        | Other (specify)                                  | Other (specify)                                  | Other (specify)                                     |   |
| Fish Soup/Sauce                             | ---                        | Fish Soup/Sauce                                  | Fish Soup/Sauce                                  | Fish Soup/Sauce                                     |   |
| Thobwa                                      | ---                        | Thobwa                                           | Thobwa                                           | Thobwa                                              |   |
| Maheu                                       | ---                        | Maheu                                            | Maheu                                            | Maheu                                               |   |
| Chibuku (Commercial Traditional-Style Beer) | ---                        | Chibuku (commercial traditional-style beer)      | Chibuku (commercial traditional-style beer)      | ---                                                 |   |
| Cocoa, Millo                                | ---                        | Cocoa, millo                                     | Cocoa, millo                                     | ---                                                 |   |
| Honey                                       | ---                        | Honey                                            | Honey                                            | Honey                                               |   |
| Mutton                                      | ---                        | Mutton                                           | Mutton                                           | Mutton                                              |   |
| Mushroom                                    | ---                        | Mushroom                                         | Mushroom                                         | Mushroom                                            |   |
| Macademia Nuts                              | ---                        | Macademia nuts                                   | Macademia nuts                                   | Macademia nuts                                      |   |
| Smoked Fish (Medium Variety)                | ---                        | ---                                              | Smoked fish (Medium Variety)                     | Smoked fish (Medium Variety)                        |   |
| Smoked Fish (Large Variety)                 | ---                        | ---                                              | Smoked fish (Large Variety)                      | Smoked fish (Large Variety)                         |   |
| Fresh Fish (Small Variety)                  | ---                        | ---                                              | Fresh fish (Small Variety)                       | Fresh fish (Small Variety)                          |   |
| Fresh Fish (Medium Variety)                 | ---                        | ---                                              | Fresh fish (Medium Variety)                      | Fresh fish (Medium Variety)                         |   |
| Fresh Fish (Large Variety)                  | ---                        | ---                                              | Fresh fish (Large Variety)                       | Fresh fish (Large Variety)                          |   |
| Sun Dried Fish (Small Variety)              | ---                        | ---                                              | Sun Dried fish (Small Variety)                   | Sun Dried fish (Small Variety)                      |   |
| Sun Dried Fish (Medium Variety)             | ---                        | ---                                              | Sun Dried fish (Medium Variety)                  | Sun Dried fish (Medium Variety)                     |   |
| Sun Dried Fish (Large Variety)              | ---                        | ---                                              | Sun Dried fish (Large Variety)                   | Sun Dried fish (Large Variety)                      |   |
| Other(Specify)                              | ---                        | ---                                              | Other(specify)                                   | ---                                                 |   |
| Zikondamoyo/Nkate                           | ---                        | ---                                              | ---                                              | Zikondamoyo / Nkate                                 |   |
| Popcorn                                     | ---                        | ---                                              | Popcorn                                          | Popcorn                                             |   |
| Groundnut Fresh (Unshelled)                 | ---                        | ---                                              | ---                                              | Groundnut Fresh (UnShelled)                         |   |
| Smoked Fish (Small Variety)                 | ---                        | ---                                              | Smoked fish (Small Variety)                      | Smoked fish (Small Variety)                         |   |
| Chibuku(Commercial Traditional-Style Beer)  | ---                        | ---                                              | ---                                              | Chibuku(commercial traditional-style beer)          |   |
| Cocoa, Milo                                 | ---                        | ---                                              | ---                                              | Cocoa, milo                                         |   |
| Kalongonda (Mucuna)                         | ---                        | ---                                              | ---                                              | KALONGONDA (Mucuna)                                 |   |
| Groundnut Dried (Unshelled)                 | ---                        | ---                                              | ---                                              | Groundnut Dried (UnShelled)                         |   |

** TODO conversion_to_kgs.json
IHS3-IHS5 have conversion tables provided to convert various item units into kilograms. Values for conversion factors were broken down by region and source type, and there is a unique table for ISH3 and ISH5. Documentation indicates that similar methods were used for ISH4, so unit conversions were taken from ISH3--the factors can be found in the csv file /2013/_. Please see IHS3’s document entitled “Malawi_IHS3_Food_Item_Conversion_Factors.pdf” for more information on how this was conducted. For the intents of conversion to kg for ISH5 as it contains several conservation factors for each food/unit/region combination, the mean of conversion factors was taken to populate the factors column. There are some minor issues where item naming does not match up perfectly between the conversion table and the food acquired ones. Names from the conversion table were slightly cleaned, but using a similar method as the one for constructing food_items.org may be better. ISH2 does not have any information on food conversion.

Some items have additionally specified unit names found under “unitsdetail_” because they were not among the standard units. Some of these have names such as ‘200 GRAMS’ that indicate the units in a manner that can be converted easily to kg. Conversion factors were additionally updated with information from these columns. Only consumption and expenditure quantities were converted for now.
For items that have such unit conversions already done, they were scaled by the conversion factor given or otherwise specified.

** DONE other_features.py
** DONE household_characteristics.py
** DONE food_acquired.py

Test...
#+begin_src python :results output
import pandas as pd

fa = pd.read_parquet('../var/food_acquired.parquet')

print(fa.describe())
#+end_src

** DONE food_prices_quantities_and_expenditures.py
Rerun once food labels are standardized. Note, there are some food items with two entries having different units, causing some errors with non-unique indexes. These were summed for convenience for now.

Test...
#+begin_src python :results output
import pandas as pd

print(pd.read_parquet('../var/food_prices.parquet').describe())
print(pd.read_parquet('../var/food_quantities.parquet').describe())
print(pd.read_parquet('../var/food_expenditures.parquet').describe())
#+end_src

** TODO Food Conversion Table
Malawi data also contains caloric data

* Files in Malawi/<SOMEYEAR>/_/
** DONE household_characteristics.py
** DONE food_acquired.py
** DONE other_features.py
